Revit 2024 API
DuplicateTypeNamesHandlerArgs.Document Property
 The document that contains the types with duplicate names.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public Document Document { get; }
Visual Basic
Public ReadOnly Property Document As Document
	Get
Visual C++
public:
property Document^ Document {
	Document^ get ();
}
See Also
DuplicateTypeNamesHandlerArgs Class
Autodesk.Revit.DB Namespace